// 霸都丶傲天 2019年10月10日 https://github.com/AJLoveChina/birthday
var config = {
    // 句子的长度可以任意， 你可以写十句话， 二十句话都可以
    // 每句话尽量不要超过15个字,不然展示效果可能不太好
    texts: [
        "送给我",      //这里,每句话结尾的最后一个逗号必须是英文的哦!! 很重要哦!!
        "心爱的猪钦宝宝",  // 同上...
        "今天是你的生日",
        "这是我们在一起之后",
        "陪你过的第一个生日哟",
        "有人住高楼",
        "有人在深渊",
        "有人光芒万丈",
        "有人一身铜锈",
        "世人千万种",
        "浮云莫强求",
        "斯人若彩虹",
        "遇上方知有",
        "猪钦 我爱你",
        "我爱你 不只因为你的样子",
        "还因为 跟你在一起时我的样子",
        "爱就像",
        "就像风一样",
        "就像巧克力",
        "就像是一场梦",
        "就像大海深爱着水",
        "爱不是人类发明出来的东西",
        "它一直都存在 而且很强大",
        "爱是如此壮丽辉煌",
        "爱会把我们带到我们所属的地方",
        "爱就是你所需要的一切",
        "爱就是永远不要说抱歉",
        "爱是永恒的耐心",
        "爱是感恩",
        "多少人终其一生",
        "却又求之不得",
        "就像是物理学",
        "就像是蜜蜂看到花一样",
        "就像是毒药 会让聪明的人做出愚蠢的事",
        "事实就是",
        "我爱你",
        "你就是繁余生活里的一缕清风",
        "爱就像",
        "就像风一样",
        "虽然看不到 但是可以感受到",
        "你是我生命中 唯一没有解开的谜",
        "祝宝贝猪钦生日快乐",
        "新的一岁 事事顺利 平平安安 健健康康 快快乐乐！",
        "I love u three thousand",
    ],
    /**
     * imgs 可以不填, 但是如果要填写的话必须遵循下面的格式
     * "对应上面的文字, 要完全一样" : "图片地址, 可以把图片放在imgs文件夹中"
     * 例如
     * "心爱的小可爱": "./imgs/xiaokeai.jpg"
     *
     * 如果不要图片的话, 直接在每行开头写两个斜杠注释即可, 例如下面的 "今天是你的生日" 的图片就不会展示了:)
     * Tip: 图片最好用正方形or接近正方形, 看起来效果更好
     */
    imgs: {
        "心爱的猪钦宝宝": "./imgs/xiaoka.png",
        // "今天是你的生日": "./imgs/birthday.jpg",
    },
    // 按钮文字描述, 以下是默认的按钮文字，英文的，您可以改成你喜欢的文字
    desc: {
        turn_on: "开始",
        play: "音乐",
        bannar_coming: "颜色",
        balloons_flying: "好像少点东西",
        cake_fadein: "蛋糕？",
        light_candle: "蜡烛？",
        wish_message: "生日快乐",
        story: "A MESSAGE FOR YOU",
    }
};
